{"data":{"site":{"siteMetadata":{"title":"Bruno Luiz Silva","icon":"/coffee.png"}},"allMarkdownRemark":{"edges":[{"node":{"excerpt":"GraphQL, REST, gRPC, Thrift… Have you ever imagined how to stick these together in a micro-services architecture and expose to the world? There are some common ways to do it, such as using Nginx or Kong. But, an alternative way to do this…","fields":{"slug":"/graphql-as-a-gateway/"},"frontmatter":{"date":"July 01, 2019","title":"GraphQL feat API Gateway"}}},{"node":{"excerpt":"Today, Kubernetes is the de facto container orchestration solution. Together with the devops culture, developers have to get familiarised to its tools, such as  kubectl . After some point though, using  kubectl  for everything can get quite…","fields":{"slug":"/2019/mar/kubernetes-devops-productivity-hacks/"},"frontmatter":{"date":"March 14, 2019","title":"Kubernetes devops productivity hacks"}}},{"node":{"excerpt":"If you are not new in the JavaScript world, you might have already heard about  npm . It is a package manager which lets developers easily add dependencies to projects, as  npm install hello-world . But, have you ever asked, “How do I…","fields":{"slug":"/2019/feb/a-guide-to-npm-package-publishing/"},"frontmatter":{"date":"February 15, 2019","title":"A guide on npm package publishing"}}},{"node":{"excerpt":"There is one big and very special date on the e-commerce and retail market and it’s called Black Friday. For many, it means “discount prices”, “sale!”, “50% off”, but for developers and IT people it is a challenging adventure. To begin with…","fields":{"slug":"/2018/mar/a-tale-of-how-to-not-deploy-two-months-old-features/"},"frontmatter":{"date":"March 07, 2018","title":"A Tale Of How To Not Deploy Two Months Old Features"}}},{"node":{"excerpt":"As the saying goes:  never trust user input . People coming from PHP and Java have many validation libraries available. But what about JavaScript? There are some options, but none seems more interesting than Joi. Joi  is maintained by  Hapi…","fields":{"slug":"/2017/aug/joi-validate-input-and-define-databases-in-javascript/"},"frontmatter":{"date":"August 30, 2017","title":"Joi: validate input and define databases in JavaScript"}}},{"node":{"excerpt":"GitFlow is a branching model created by Vincent Driessen on 2010 ( original article ). Since it was published, many companies had tested and implemented it, which allows us to have many reviews about how well (or not) it works. After some…","fields":{"slug":"/2017/jul/still-using-gitflow-what-about-a-simpler-alternative/"},"frontmatter":{"date":"July 18, 2017","title":"Still using GitFlow? What about a simpler alternative?"}}},{"node":{"excerpt":"You are developing some feature together with your team. Most likely you have done the usual dance: checkout a branch from the master or development branch, done your commits, pushed this feature branch to the remote and opened a push…","fields":{"slug":"/2017/jun/are-you-using-git-push-force-oh-mate-you-are-doing-it-wrong/"},"frontmatter":{"date":"June 03, 2017","title":"Are you using git push force? Oh mate, you are doing it wrong!"}}}]}},"pageContext":{}}