{"data":{"site":{"siteMetadata":{"title":"Bruno Luiz Blog","author":"Bruno Luiz Silva"}},"markdownRemark":{"id":"76a9ce47-f486-5ba3-9bb0-c87ce7caa6d6","excerpt":"GraphQL, REST, gRPC, Thrift… Have you ever imagined how to glue these together, in a micro-services architecture, and expose to the world? There are some common…","html":"<p>GraphQL, REST, gRPC, Thrift… Have you ever imagined how to glue these together, in a micro-services architecture, and expose to the world? There are some common ways to do it, such as using Nginx or Kong, but an alternative way to do this is by using GraphQL in front of all services.</p>\n<h2>API Gateway pattern — a quick introduction</h2>\n<p>Considering service A and B, how a client would be able to request it’s data? The easiest and straight forward way would be to do a request to service A and another to B, each request pointing to different hosts.</p>\n<p>The problem is, as the number of services grow, it is quite laborous to keep up with this strategy. To solve this, a proxy can be used, where the client will request to only one host instead of multiple, and this proxy service will orchestrate where this request should go, gluing all services in one place.</p>\n<p>API Gateways work as a proxy, but with some extras: caching, request transformation, throttling, security and others. GraphQL servers, been usually normal services, are highly configurable and can offer these as well.</p>\n<h2>Why GraphQL and not REST?</h2>\n<p>The gateway pattern is kinda well known, but why would a company opt by GraphQL instead of REST?</p>\n<h3>Schema validation and documentation</h3>\n<p>In GraphQL, differently from REST, a schema is always required, following GraphQL Foundation directives. This allows not only schema validation since day 1, but documentation as well. Usually typed languages can generate type definitions using the graphql schema (example: <a href=\"https://github.com/dotansimha/graphql-code-generator\">typescript graphql-code-generator</a>)</p>\n<p>In theory, the same could be done in REST by using OpenAPI/Swagger (specially for documentation), but the code generation tools are not exactly the best and usually the schema validation do not work properly (or do not work at all).</p>\n<h3>One endpoint, multiple queries</h3>\n<p>GraphQL only exposes one endpoint. With this, instead of having N client requests to properly get an information, in GraphQL only one is needed, with the server orchestrating everything required to fulfill the request.</p>\n<p>The caveats with this are: how to deal with bulk queries and how to properly rate limit clients.</p>\n<ul>\n<li><a href=\"https://developer.github.com/v4/guides/resource-limitations/\">https://developer.github.com/v4/guides/resource-limitations/</a></li>\n</ul>\n<h3>Out-of-box standards</h3>\n<ul>\n<li>Sparse fieldset</li>\n<li>Versioning</li>\n</ul>\n<h3>Developer experience</h3>\n<h2>References</h2>\n<ul>\n<li><a href=\"https://unsplash.com/photos/8S96OpxSlvg\">Photo by Christian Stahl on Unsplash</a></li>\n<li><a href=\"https://microservices.io/patterns/apigateway.html\">Pattern: API Gateway / Backend for Front-End</a></li>\n<li><a href=\"https://stoplight.io/blog/api-proxy-vs-api-gateway-c008c942a02d/\">API Proxy vs API Gateway</a></li>\n</ul>","frontmatter":{"title":"GraphQL as a Gateway","date":"April 03, 2019","cover":null}}},"pageContext":{"slug":"/graphql-as-a-gateway/","previous":{"fields":{"slug":"/2019/mar/kubernetes-devops-productivity-hacks/"},"frontmatter":{"title":"Kubernetes devops productivity hacks"}},"next":null}}