{"data":{"site":{"siteMetadata":{"title":"Bruno Luiz Blog","author":"Bruno Luiz Silva"}},"markdownRemark":{"id":"76a9ce47-f486-5ba3-9bb0-c87ce7caa6d6","excerpt":"GraphQL, REST, GRPC, Thrift… Have you ever imagined how to stick these together, in a micro-services architecture, and expose to the world? There are some…","html":"<p>\n  <a\n    class=\"gatsby-resp-image-link\"\n    href=\"/static/fb5da5c014432c6f403808a14ba084c5/4d3f0/cover.jpg\"\n    style=\"display: block\"\n    target=\"_blank\"\n    rel=\"noopener\"\n  >\n  \n  <span\n    class=\"gatsby-resp-image-wrapper\"\n    style=\"position: relative; display: block;  max-width: 720px; margin-left: auto; margin-right: auto;\"\n  >\n    <span\n      class=\"gatsby-resp-image-background-image\"\n      style=\"padding-bottom: 66.75398384632176%; position: relative; bottom: 0; left: 0; background-image: url('data:image/jpeg;base64,/9j/2wBDABALDA4MChAODQ4SERATGCgaGBYWGDEjJR0oOjM9PDkzODdASFxOQERXRTc4UG1RV19iZ2hnPk1xeXBkeFxlZ2P/2wBDARESEhgVGC8aGi9jQjhCY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2P/wgARCAANABQDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAAAAME/8QAFgEBAQEAAAAAAAAAAAAAAAAAAwAE/9oADAMBAAIQAxAAAAHdC0Qs4fB//8QAGBABAAMBAAAAAAAAAAAAAAAAAAEEQUL/2gAIAQEAAQUC2yh1ZQ//xAAWEQADAAAAAAAAAAAAAAAAAAADEDH/2gAIAQMBAT8BNF//xAAWEQADAAAAAAAAAAAAAAAAAAADEDH/2gAIAQIBAT8BBF//xAAWEAEBAQAAAAAAAAAAAAAAAAACEAD/2gAIAQEABj8Cxpn/xAAZEAACAwEAAAAAAAAAAAAAAAAAARExcSH/2gAIAQEAAT8hVdL6OlbEoTrsvoSUf//aAAwDAQACAAMAAAAQYB//xAAWEQEBAQAAAAAAAAAAAAAAAAAAATH/2gAIAQMBAT8Q1Wv/xAAVEQEBAAAAAAAAAAAAAAAAAAAQMf/aAAgBAgEBPxCh/8QAHhAAAwAABwEAAAAAAAAAAAAAAAERIUFhcYGRwfD/2gAIAQEAAT8Qe7Y7XliuqVoOapUweQ8h9jHVqXB//9k='); background-size: cover; display: block;\"\n    >\n      <img\n        class=\"gatsby-resp-image-image\"\n        style=\"width: 100%; height: 100%; margin: 0; vertical-align: middle; position: absolute; top: 0; left: 0; box-shadow: inset 0px 0px 0px 400px white;\"\n        alt=\"Photo by Christian Stahl on Unsplash\"\n        title=\"\"\n        src=\"/static/fb5da5c014432c6f403808a14ba084c5/cfe7c/cover.jpg\"\n        srcset=\"/static/fb5da5c014432c6f403808a14ba084c5/f39eb/cover.jpg 180w,\n/static/fb5da5c014432c6f403808a14ba084c5/e1b9c/cover.jpg 360w,\n/static/fb5da5c014432c6f403808a14ba084c5/cfe7c/cover.jpg 720w,\n/static/fb5da5c014432c6f403808a14ba084c5/deb56/cover.jpg 1080w,\n/static/fb5da5c014432c6f403808a14ba084c5/cf22f/cover.jpg 1440w,\n/static/fb5da5c014432c6f403808a14ba084c5/54366/cover.jpg 2160w,\n/static/fb5da5c014432c6f403808a14ba084c5/4d3f0/cover.jpg 4581w\"\n        sizes=\"(max-width: 720px) 100vw, 720px\"\n      />\n    </span>\n  </span>\n  \n  </a>\n    </p>\n<p>GraphQL, REST, GRPC, Thrift… Have you ever imagined how to stick these together, in a micro-services architecture, and expose to the world? There are some common ways to do it, such as using Nginx or Kong, but an alternative way to do this is by using GraphQL in front of all services.</p>\n<h2>⏩ API Gateway pattern — a quick introduction</h2>\n<p>Considering service A and B, how a client would be able to request it’s data? The easiest and straight forward way would be to do a request to service A and another to B, each request pointing to different hosts (eg: <code>a.service/orders</code> and <code>b.service/users</code>).</p>\n<p>As the number of services grow, it is quite laborous to keep up with this strategy, as there could be too many services and requests to coordinate. To solve this, an API proxy can be used, where the client will request to only one service instead of multiple, and this proxy will orchestrate where this request should go, gluing all services in one place.</p>\n<p>While proxies just forward requests, API Gateways encapsulate more of the application internal architecture, working as a Facade, with some other responsabilities as well, such as:</p>\n<ul>\n<li>Request/Response Transformation: requests made by a client can be reshaped before sent to internal services, with the same applying to responses</li>\n<li>Request routing: as the proxy, route requests to specific services, translating to other protocols if required</li>\n<li>Composition: one request to the gateway can actually be mapped to multiple internal API requests</li>\n<li>Throttling: limit an user number of requests</li>\n<li>Security: protect some endpoints with some sort of authentication (jwt token, basic, api tokens etc)</li>\n<li>Metrics and Logs: as all requests would pass through it, many metrics and logs will be collected through this service</li>\n</ul>\n<p>GraphQL servers can implement some of these features — or developers can implement quite easily — but then what is and why GraphQL?</p>\n<blockquote>\n<p>For more information on the API gateway pattern, give a look at <a href=\"https://www.nginx.com/blog/building-microservices-using-an-api-gateway/\">nginx micro-services article</a> and on this <a href=\"https://freecontent.manning.com/the-api-gateway-pattern/\">Chris Richardson article</a>.</p>\n</blockquote>\n<h2>🙋 Why GraphQL and not REST?</h2>\n<p>GraphQL was initially developed by Facebook, <a href=\"https://code.fb.com/core-data/graphql-a-data-query-language/\">been open-sourced in 2015</a>. Many companies started using it for internal APIs, but some are already exposing it as its public API (eg: GitHub, Shopify, Yelp and Contenful).</p>\n<h3>Schema validation and documentation</h3>\n<p>In GraphQL, differently from REST, a schema is always required, following <a href=\"https://graphql.org\">GraphQL Foundation</a> directives. This allows not only schema validation since day one, but documentation as well. Typed languages can benefit from the schema and generate type definitions through it (eg: <a href=\"https://github.com/dotansimha/graphql-code-generator\">typescript graphql-code-generator</a>).</p>\n<p>In theory, the same could be done in REST by using OpenAPI/Swagger, specially for documentation <del>but yaml, yikes</del>. But, the code generation tools are not exactly the best and sometimes the schema validation do not work properly, requiring extra middlewares and tweaks around it. As GraphQL is standardised in this sense, it doesn’t suffer from these issues.</p>\n<h3>An endpoint to rule them all</h3>\n<p>GraphQL only exposes one endpoint, which can be a good and bad thing. Instead of having N client requests, only one is needed, with the server orchestrating everything required to fulfill the whole request — eg: calling multiple micro-services, in multiple and different protocols (solves under-fetching issues).</p>\n<p>One of the caveats of this approach is how to properly rate limit clients, as the queries can be quite complex, with multiple underlying requests, but still being one client request. This means an API user can’t be limited through its number of calls anymore, but with something different.</p>\n<p>An approach for tackle this is by calculating the query complexity and using it as a rate limit score. <a href=\"https://developer.github.com/v4/guides/resource-limitations/\">On GitHub API docs</a>, there are examples on how they deal with this.</p>\n<h3>Out-of-box standards</h3>\n<p>REST has been around for a long time, and during this period developers started to have specific necessities, such as sparse fieldsets, versioning, pagination. There are a lot of ways of doing these, but none is really a standard (perhaps, the closest thing would be <a href=\"https://jsonapi.org/\">jsonapi</a>). GraphQL come with some of these specs out-of-box:</p>\n<ul>\n<li><a href=\"https://graphql.org/learn/queries/#fields\">Sparse fieldset</a>: while making the request, all the required fields need to be specified, avoiding over-fetching</li>\n<li><a href=\"https://graphql.org/learn/best-practices/#versioning\">Versioning</a>: versioning is not a good practice in GraphQL instead, the schema should continually evolute. New capabilities can be inserted on new types and fields, allowing the client to plan and decide when to change to new resolvers. If a field needs to be deprecated, one can use a directive such as <a href=\"https://www.apollographql.com/docs/graphql-tools/schema-directives\"><code>@deprecated</code></a>.</li>\n<li><a href=\"https://graphql.org/learn/pagination/\">Pagination</a>: there are some conventions and, for more complex implementations, there is the Connection model pattern.</li>\n</ul>\n<p>Of course, there are other stuff which one can compare against REST, but the idea is to show that GraphQL can be an option.</p>\n<h3>Developer experience</h3>\n<p>Front-end and back-end developers can easily settle in a schema and, in a question of minutes, have stubs around it. Besides, code generation, IDE auto-completion, easy documentation/schema discovery and good API exploring tools (such as GraphQL Playground and GraphIQL) makes the development experience way nicer when compared to REST.</p>\n<h2>⚡ GraphQL as your API Gateway</h2>\n<p>High hopes that you are convinced on trying GraphQL 🙌. Implementing a GraphQL server is not complicated and there are many guides in the web talking about it. <a href=\"https://graphql.org/code\">This list</a> has server implementations, separated by language.</p>\n<p>As teams develop micro-services independently, a strategy is required to expose and change the public facing GraphQL API. There are three main strategies for it:</p>\n<h3>Remote schema stitching</h3>\n<p>The gateway will get the schema from other GraphQL services and then stich them together as the public facing schema. This allows more freedom for teams, but it will disperse the API schema through multiple places, making it harder to test and easier to break, with a chance to have merge/stiching conflict.</p>\n<p>Although this can be a problem, teams can make releases without even touching the API Gateway, making the deploys isolated instead of requiring constant API Gateways deploys.</p>\n<blockquote>\n<p>Recently, Apollo Server implemented <a href=\"https://www.apollographql.com/docs/apollo-server/federation/introduction/\">Federation</a>, which will replace remote schema stitching. Bear in mind it is still Apollo specific.</p>\n</blockquote>\n<h3>API Gateway owns schemas</h3>\n<p>Schema is contained locally on the gateway. This easy the development and test, as everything will be in the same place. The caveat is that the service will be constantly modified by multiple teams (resolvers, schemas), requiring constant gateway releases.</p>\n<p>As this service will be constantly modified by multiple people, rules around code formatting and style should be agreed through all teams to make the code uniform.</p>\n<blockquote>\n<p>Personally, I prefer this one as it keeps everything in one place, gives high visibility on what is happening and allow easy discovery of other resolvers.</p>\n</blockquote>\n<h3>Combination of both above</h3>\n<p>It is possible to mix both strategies, which is specially useful if the team wants to use remote schema stitching but have some services using GRPC or HTTP. Another way to tackle those non-GraphQL services is to put a server in front of it, allowing schema stiching and giving more flexibility for the the responsible team.</p>\n<h2>💡 Conclusion</h2>\n<p>Hopefully, this might have clarified a bit what to expect from GraphQL as the main gateway. For those who want to go deeper, there are some references below, from where I took notes for this post.</p>\n<h2>📘 References</h2>\n<h4>API Gateway</h4>\n<ul>\n<li><a href=\"https://www.nginx.com/blog/building-microservices-using-an-api-gateway/\">Ngnix micro-services book chapter about API Gateway</a></li>\n<li><a href=\"https://freecontent.manning.com/the-api-gateway-pattern/\">Chris Richardson article about API Gateway</a></li>\n<li><a href=\"https://stoplight.io/blog/api-proxy-vs-api-gateway-c008c942a02d/\">API Proxy vs API Gateway</a></li>\n<li><a href=\"https://microservices.io/patterns/apigateway.html\">Pattern: API Gateway / Back-end for Front-End</a></li>\n</ul>\n<h4>GraphQL</h4>\n<ul>\n<li><a href=\"https://graphql.org/learn/\">GraphQL Documentation</a></li>\n<li><a href=\"https://developer.github.com/v4/guides/resource-limitations/\">GitHub GraphQL Resource Limitations Documentation</a></li>\n<li><a href=\"https://tomasalabes.me/blog/graphql/node/microservices/2018/08/11/graphql-architectures.html\">GraphQL Gateway Architectures</a></li>\n<li><a href=\"https://www.robinwieruch.de/why-graphql-advantages-disadvantages-alternatives/\">Why GraphQL: Advantages, Disadvantages &#x26; Alternatives</a></li>\n<li><a href=\"https://webapplog.com/graphql/\">Why GraphQL is Taking Over APIs</a></li>\n<li><a href=\"https://www.apollographql.com/docs/graphql-tools/schema-stitching\">Schema stitching — Combining multiple GraphQL APIs into one</a></li>\n<li><a href=\"https://blog.apollographql.com/apollo-federation-f260cf525d21\">Apollo Federation</a></li>\n</ul>\n<h4>Tools</h4>\n<ul>\n<li><a href=\"https://github.com/dotansimha/graphql-code-generator\">Typescript graphql-code-generator</a></li>\n</ul>\n<h4>Images</h4>\n<ul>\n<li><a href=\"https://unsplash.com/photos/8S96OpxSlvg\">Cover Photo by Christian Stahl on Unsplash</a></li>\n</ul>\n<h4>Other</h4>\n<ul>\n<li><a href=\"https://jsonapi.org/\">JSONAPI: REST alternative to GraphQL</a></li>\n<li><a href=\"https://stackoverflow.com/questions/44564905/what-is-over-fetching-or-under-fetching/44568365\">What is over and under-fetching</a></li>\n</ul>","frontmatter":{"title":"GraphQL feat API Gateway","date":"July 01, 2019","cover":{"childImageSharp":{"fixed":{"width":1200,"height":801,"src":"/static/fb5da5c014432c6f403808a14ba084c5/935ac/cover.jpg","srcSet":"/static/fb5da5c014432c6f403808a14ba084c5/935ac/cover.jpg 1x,\n/static/fb5da5c014432c6f403808a14ba084c5/77668/cover.jpg 1.5x,\n/static/fb5da5c014432c6f403808a14ba084c5/5347b/cover.jpg 2x,\n/static/fb5da5c014432c6f403808a14ba084c5/6da74/cover.jpg 3x"}}}}}},"pageContext":{"slug":"/graphql-as-a-gateway/","previous":{"fields":{"slug":"/2019/mar/kubernetes-devops-productivity-hacks/"},"frontmatter":{"title":"Kubernetes devops productivity hacks"}},"next":null}}